my_list = [42, 69, 322, 13, 0, 99, -5, 9, 8, 7, -6, 5]
a = 0

# этот вариант почему то останавливается на первом числе и дальше не идет(искала подсказку в интернете)
# while a == 0:
#     print(my_list[a])
#     a += 1

# Этот бесконечно повторяет 42 и не переходит к другим числам(тоже искала в интернете)
# while a < len(my_list):
#     if my_list[a] < 0:
#         continue
#     print(my_list[a])
#     a >= 1

# К этому вообще не поняла как прикрутить чтобы он по очереди обращался к каждому числу в списке(сама изобретала велосипед)
# while my_list[] > len(my_list):
#     if my_list[] > a:
#         print(my_list[])
#     else:
#         continue

# вообще не работает(мой велосипед с квадратными колесами. За то сама сделалал)
# while my_list[a] == 0:
#     if my_list[a] < a:
#         continue
#     print(my_list[a])

