# тут опишу как сделать из кода полноценное приложение
# и исполняемым файлом можно будет воспользоваться без пучарм

# нужно воспользоваться менеджером пакетов
# зайти в терминал, для этого нажать слева снизу на кнопку с >_

# вписать в консоль pip install auto-py-to-exe и нажать интер
# после того как написали, надо подождать пока он там настрочит и остановится

# затем написать auto-py-to-exe и нажать интер
# далее откроется окно, в нем выбрать путь к файлу

# выбрать один файл и оконное приложение
# нажать на кнопку convert.py to.exe

# открыть папку вывода - там файл с нашим калькулятором)

# антивирус может не дать создать файл, но его можно отключить на время

#               то что ниже пока не нужно
# в окне можно поменять язык
# выбрать иконку
# доп файлы
# расширения
