from config import *

start = 'Приветствуем в магазине настольных игр!'

about = 'Мы продаем лучшие игры уже 200 000 лет, а еще мы никогда не врем.'

choice = 'Что вас интересует?'

Mgame = f'Лучший вариант для начинающих, игра небольшого размера(подходит для тупиц). Стоимость {priceM} тугриков.'

Lgame = (f'Подходит для тех кто уже не тупица, но не располагает несколькими столетиями свободного времени. '
         f'Стоимость {priceL} тугриков.')

XLgame = (f'Есть в запасе немного свободного времени, примерно лет 100? Тогда этот комплект для вас! '
          f'Стоимость {priceXL} тугриков.')

other = ('Нужно что-то еще? Пишите: @ляляля')
